backend/app/controllers/api/v1/expenses_controller.rb

SELECT "expenses".* FROM "expenses"
---
  def index
    expenses = Expense.all

INSERT INTO "expenses" ("date", "description", "amount", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["date", "2021-05-27"], ["description", "soap"], ["amount", 7.0], ["created_at", "2021-05-28 01:52:37.807784"], ["updated_at", "2021-05-28 01:52:37.807784"], ["user_id", 1]]
---
  def create
    expense = Expense.new(expense_params)
    if expense.save